config.org
#+title: Emacs configuration
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el

* Startup

#+begin_src emacs-lisp :tangle ./early-init.el
  (setq gc-cons-threshold most-positive-fixnum)
  (add-hook 'after-init-hook
            #'(lambda () (setq gc-cons-threshold (* 8 1024 1024))))

  (server-start)
  (setq inhibit-startup-message t)
#+end_src

* Package management
** Package & use-package

#+begin_src emacs-lisp
  (require 'package)

  (setq package-archives '(("melpa" . "https://melpa.org/packages/")
                           ("org" . "https://orgmode.org/elpa/")
                           ("elpa" . "https://elpa.gnu.org/packages/")))
  (package-initialize)
  (unless package-archive-contents
    (package-refresh-contents))

  ;; initialize use-package on Non-linux platforms
  (unless (package-installed-p 'use-package)
    (package-install 'use-package))

  (require 'use-package)
  (setq use-package-always-ensure t)
#+end_src

** Straight

#+begin_src emacs-lisp
  (defvar bootstrap-version)
  (let ((bootstrap-file
         (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
        (bootstrap-version 5))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
          (url-retrieve-synchronously
           "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
           'silent 'inhibit-cookies)
        (goto-char (point-max))
        (eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))

  (straight-use-package 'use-package)
#+end_src

** Auto-package-update

#+begin_src emacs-lisp
  (use-package auto-package-update
    :config
    (setq auto-package-update-delete-old-versions t)
    (setq auto-package-update-hide-results t)
    (auto-package-update-maybe))
#+end_src

** Which-OS

#+begin_src emacs-lisp
  (use-package which-os
    :straight (:host github :repo "kolemikko/which-os" :branch "master"))
#+end_src

** Exec-path-from-shell

#+begin_src emacs-lisp
  (use-package exec-path-from-shell)

  (when (memq window-system '(mac ns x))
    (exec-path-from-shell-initialize))
#+end_src

* UI
** General

#+begin_src emacs-lisp :tangle ./early-init.el
  (scroll-bar-mode -1)
  (tool-bar-mode -1)
  (tooltip-mode -1)
  (menu-bar-mode -1)
  (setq visible-bell 1)

  (set-frame-parameter (selected-frame) 'fullscreen 'maximized)
  (add-to-list 'default-frame-alist '(fullscreen . maximized))


  (global-display-line-numbers-mode t)
  (dolist (mode '(org-mode-hook
                  term-mode-hook
                  shell-mode-hook
                  treemacs-mode-hook
                  eshell-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 0))))
#+end_src

** Fonts

#+begin_src emacs-lisp
  (set-default-coding-systems 'utf-8)
  (setq my/default-font-size '130)

  (when (is-mac)
    (set-face-attribute 'default nil :font "Fira Code" :height my/default-font-size))

  (when (is-linux)
    (set-face-attribute 'default nil :font "Source Code Pro" :height my/default-font-size))

  (set-face-attribute 'variable-pitch nil :font "Cantarell" :height my/default-font-size :weight 'regular)
#+end_src

** Theme

#+begin_src emacs-lisp
  (use-package doom-themes
    :init (load-theme 'doom-gruvbox t))

  (use-package doom-modeline
    :after eshell
    :hook (after-init . doom-modeline-init)
    :custom
    (doom-modeline-height 15)
    (doom-modeline-bar-width 5))
#+end_src

** All-the-icons

#+begin_src emacs-lisp
  (use-package all-the-icons
    :if (display-graphic-p))
#+end_src

** Dashboard

#+begin_src emacs-lisp
  (use-package dashboard
    :init
    (add-hook 'after-init-hook 'dashboard-refresh-buffer)
    :config
    (setq dashboard-items '((recents . 6)
                            (projects . 6)
                            (agenda . 9)))
    (setq
     dashboard-banner-logo-title "Emacs FTW!"
     dashboard-footer-messages '("")
     dashboard-startup-banner 'logo
     dashboard-page-separator "\n\n\n"

     dashboard-item-names '(("Agenda for the coming week:" . "Agenda:"))

     dashboard-week-agenda t
     dashboard-filter-agenda-entry 'dashboard-no-filter-agenda
     dashboard-match-agenda-entry "TODO=\"TODO\"|TODO=\"INPROGRESS\""
     dashboard-agenda-sort-strategy '(todo-state-down)

     dashboard-center-content t
     dashboard-set-heading-icons nil
     dashboard-set-file-icons nil
     dashboard-center-content t
     dashboard-set-init-info t
     dashboard-items-default-length 30)
    (dashboard-setup-startup-hook))
#+end_src

* Usability
** Yes-No

#+begin_src emacs-lisp
  (fset 'yes-or-no-p 'y-or-n-p)
#+end_src

** No littering

#+begin_src emacs-lisp
  (use-package no-littering)

  (setq auto-save-file-name-transforms
        `((".*" ,(no-littering-expand-var-file-name "auto-save/") t)))
#+end_src

** Ignored extensions

#+begin_src emacs-lisp
  (setq completion-ignored-extensions '(".meta"))
#+end_src

** Helpful

#+begin_src emacs-lisp
  (use-package helpful
    :bind
    ([remap describe-command] . helpful-command)
    ([remap describe-key] . helpful-key))
#+end_src

** WS-butler

#+begin_src emacs-lisp
  (use-package ws-butler
  :hook ((text-mode . ws-butler-mode)
          (prog-mode . ws-butler-mode)))
#+end_src

** Rainbow delimiters

#+begin_src emacs-lisp
  (use-package rainbow-delimiters
    :hook (prog-mode . rainbow-delimiters-mode))
#+end_src

** Diminish

#+begin_src emacs-lisp
  (use-package diminish)
#+end_src

** Vertigo

#+begin_src emacs-lisp
  (defun my/vertigo-backward-kill (arg)
    (interactive "p")
    (if minibuffer-completing-file-name
        (if (string-match-p "/." (minibuffer-contents))
            (zap-up-to-char (- arg) ?/)
          (delete-minibuffer-contents))
        (backward-kill-word arg)))

    (use-package vertico
      :bind
      (:map minibuffer-local-map ("<left>" . my/vertigo-backward-kill))
      :custom
      (vertico-cycle t)
      :init
      (vertico-mode))
#+end_src

** Savehist

#+begin_src emacs-lisp
  (use-package savehist
    :init
    (setq history-length 20)
    (savehist-mode 1))
#+end_src

** Marginalia

#+begin_src emacs-lisp
  (use-package marginalia
    :after vertico
    :custom
    (marginalia-annotators '(marginalia-annotators-heavy marginalia-annotators-light nil))
    :init
    (marginalia-mode))
#+end_src

** Orderless

#+begin_src emacs-lisp
  (use-package orderless
    :custom (completion-styles '(orderless)))
#+end_src

** Consult

#+begin_src emacs-lisp
  (use-package consult
    :demand t
    :custom
    (completion-in-region-function #'consult-completion-in-region))
#+end_src

* Text editing
** Evil

#+begin_src emacs-lisp
  (setq evil-want-keybinding nil)

  (use-package evil
    :init
    (setq evil-undo-system 'undo-fu)
    (setq evil-want-integration t)
    (setq evil-want-C-u-scroll t)
    (setq evil-want-C-i-jump nil)
    (setq evil-respect-visual-line-mode t)
    :config
    (evil-mode 1)
    (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
    (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)

    (evil-set-initial-state 'messages-buffer-mode 'normal)
    (evil-set-initial-state 'dashboard-mode 'motion)
    (evil-set-initial-state 'pdf-view-mode 'motion))

  (use-package evil-collection
    :after evil
    :config
    (evil-collection-init))

  (use-package evil-nerd-commenter
    :bind ("C-/" . evilnc-comment-or-uncomment-lines))
#+end_src

** Undo-fu

#+begin_src emacs-lisp
  (use-package undo-fu
    :config
    (define-key evil-normal-state-map "u" 'undo-fu-only-undo)
    (define-key evil-normal-state-map "U" 'undo-fu-only-redo))
#+end_src

** Flyspell

#+begin_src emacs-lisp
  ;; NOTE: requires ispell on macos and hunspell on linux
  (use-package flyspell
    :hook (markdown-mode . flyspell-mode))
#+end_src

* Buffer management
** Auto-revert

#+begin_src emacs-lisp
  (global-auto-revert-mode 1)
  (setq global-auto-revert-non-file-buffers t)
#+end_src

** Kill buffer in other buffer

#+begin_src emacs-lisp
  (defun my/kill-buffer-other-window ()
      (interactive)
      (other-window 1)
      (kill-buffer (current-buffer))
      (other-window 1))
#+end_src

** Kill all buffers

#+begin_src emacs-lisp
  (defun my/kill-all-buffers ()
    (interactive)
    (dolist (buffer (buffer-list))
      (kill-buffer buffer))
    (delete-other-windows))
#+end_src

** Switch to recent buffer

#+begin_src emacs-lisp
  (defun my/switch-recent-buffer ()
    (interactive)
    (if (> (length (window-list)) 1)
        (evil-window-mru)
      (switch-to-buffer (other-buffer (current-buffer) 1))))
#+end_src

** Switch to dasboard buffer

#+begin_src emacs-lisp
  (defun my/switch-to-dashboard-buffer ()
    (interactive)
    (switch-to-buffer (get-buffer "*dashboard*"))
    (revert-buffer-quick))
#+end_src

** Bufler

#+begin_src emacs-lisp
  (use-package bufler
    :config
    (evil-collection-define-key 'normal 'bufler-list-mode-map
      (kbd "RET")   'bufler-list-buffer-switch
      (kbd "TAB")     'bufler-list-buffer-peek
      "D"           'bufler-list-buffer-kill))
#+end_src

* Window management
** Text scale

#+begin_src emacs-lisp
  (use-package default-text-scale
    :bind
    (:map default-text-scale-mode-map
          ("C-+" . default-text-scale-increase)
          ("C--" . default-text-scale-decrease))
    :config
    (default-text-scale-mode))
#+end_src

* File and project management
** Dired

#+begin_src emacs-lisp
  (use-package dired
    :ensure nil
    :straight nil
    :commands (dired dired-jump)
    :config
    (setq insert-directory-program "ls" dired-use-ls-dired t
          dired-listing-switches "-al --group-directories-first"
          dired-kill-when-opening-new-dired-buffer t
          dired-omit-verbose nil
          dired-hide-details-hide-symlink-targets nil
          delete-by-moving-to-trash t)

    (evil-collection-define-key 'normal 'dired-mode-map
      (kbd "<left>") 'dired-single-up-directory
      (kbd "<right>") 'dired-single-buffer
      "p" 'dired-view-file
      "P" 'dired-display-file
      "=" 'my/diff-marked-files))

  (use-package dired-single)

  (use-package dired-collapse)

  (use-package dired-hide-dotfiles
    :hook (dired-mode . dired-hide-dotfiles-mode)
    :config
    (evil-collection-define-key 'normal 'dired-mode-map
      "H" 'dired-hide-dotfiles-mode))

  (when (is-mac)
    (setq insert-directory-program "gls" dired-use-ls-dired t)
    (setq insert-directory-program "/opt/homebrew/Cellar/coreutils/9.1/libexec/gnubin/ls"))

  (defun my/diff-marked-files ()
    (interactive)
    (let ((marked-files  ())
          (here   ()))
      (dolist (buf  (mapcar #'cdr dired-buffers))
        (when (buffer-live-p buf)
          (with-current-buffer buf
            (setq here  (dired-get-marked-files nil nil nil t)))
          (when (or (null (cdr here))  (eq t (car here)))
            (setq here  (cdr here)))
          (setq marked-files  (nconc here marked-files))))
      (setq marked-files  (delete-dups marked-files))
      (when (= (length marked-files) 1)
        (dired-diff (nth 0 marked-files)))))
#+end_src

** Projectile

#+begin_src emacs-lisp
  (use-package projectile
    :diminish projectile-mode
    :config (projectile-mode)
    :init
    (recentf-mode)
    (when (file-directory-p "~/code")
      (setq projectile-project-search-path '("~/code")))
    (setq projectile-switch-project-action #'projectile-dired)
    (setq projectile-sort-order 'recentf))
#+end_src

* Version Control
** Magit

#+begin_src emacs-lisp
  (use-package magit)
#+end_src

* Org
** Org-mode

#+begin_src emacs-lisp
  (defun my/org-mode-setup ()
    (org-indent-mode)
    (auto-fill-mode 0)
    (visual-line-mode 1))

  (use-package org
    :hook (org-mode . my/org-mode-setup)
    :diminish org-indent-mode
    :config
    (setq org-agenda-files '("~/Org"))
    (setq org-export-coding-system 'utf-8)
    (setq org-ellipsis " ▾"
          org-hide-emphasis-markers t
          org-fontify-quote-and-verse-blocks t
          org-src-fontify-natively t
          org-src-tab-acts-natively t
          org-src-preserve-indentation nil
          org-edit-src-content-indentation 2
          org-hide-block-startup nil
          org-startup-folded t
          org-cycle-separator-lines 2)

    (setq org-todo-keywords
          '((sequence "TODO"
                      "INPROGRESS"
                      "DONE")))

    (setq org-modules
          '(org-crypt)))

  (use-package org-superstar
    :after org
    :hook (org-mode . org-superstar-mode)
    :custom
    (org-superstar-remove-leading-stars t)
    (org-superstar-headline-bullets-list '("●" "○" "●" "○" "●" "○" "●")))

  (require 'org-indent)

  (set-face-attribute 'org-document-title nil :font "Cantarell" :weight 'bold :height 1.5)
  (dolist (face '((org-level-1 . 1.2)
                  (org-level-2 . 1.2)
                  (org-level-3 . 1.2)
                  (org-level-4 . 1.2)
                  (org-level-5 . 1.2)
                  (org-level-6 . 1.2)
                  (org-level-7 . 1.2)
                  (org-level-8 . 1.2)))
    (set-face-attribute (car face) nil :font "Cantarell" :weight 'medium :height (cdr face)))

  (set-face-attribute 'org-block nil :inherit 'fixed-pitch :height 1.18)
  (set-face-attribute 'org-table nil :inherit 'fixed-pitch)
  (set-face-attribute 'org-formula nil :inherit 'fixed-pitch)
  (set-face-attribute 'org-code nil :inherit 'fixed-pitch)
  (set-face-attribute 'org-indent nil :inherit '(org-hide fixed-pitch))
  (set-face-attribute 'org-verbatim nil :inherit 'fixed-pitch)
  (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch)
  (set-face-attribute 'org-column nil :background nil)
  (set-face-attribute 'org-column-title nil :background nil)

  (defun my/org-mode-visual-fill ()
    (setq visual-fill-column-width 120
          visual-fill-column-center-text t)
    (visual-fill-column-mode 1))

  (use-package visual-fill-column
    :hook (org-mode . my/org-mode-visual-fill))

  (setq calendar-week-start-day 1)
  (add-hook 'calendar-load-hook
            (lambda ()
              (calendar-set-date-style 'european)))
#+end_src

